const LOCATION_GROUPS = [
  { name: "餐厅位置", options: ["竹园食堂", "楠园一食堂", "楠园二食堂", "梅园食堂", "李园食堂", "杏园食堂", "桃园食堂", "橘园食堂", "李园小吃街", "楠园美食城"] },
  { name: "宿舍位置", options: ["竹园1区A栋", "竹园1区B栋", "竹园1区C栋", "竹园1区D栋", "竹园1区E栋", "竹园1区F栋", "竹园2区一舍", "竹园2区二舍", "竹园2区三舍", "竹园2区四舍", "竹园2区五舍", "竹园2区六舍", "竹园2区七舍", "竹园2区八舍", "楠园一舍", "楠园二舍", "楠园三舍", "楠园四舍", "楠园五舍", "楠园六舍", "楠园七舍", "楠园八舍", "楠园九舍", "李园一舍", "李园二舍", "李园三舍", "李园四舍", "李园五舍", "李园六舍", "李园七舍", "李园八舍", "橘园一舍", "橘园二舍", "橘园三舍", "橘园四舍", "橘园五舍", "橘园六舍", "橘园七舍", "橘园八舍", "橘园九舍", "橘园十舍", "橘园十一舍", "橘园十二舍", "橘园十三舍", "杏园A栋", "杏园B栋", "杏园C栋", "杏园D栋", "杏园E栋", "杏园F栋", "杏园博士后公寓", "梅园一舍", "梅园二舍", "梅园三舍", "梅园四舍", "桃园一舍", "桃园二舍", "桃园三舍", "桃园四舍", "桃园五舍", "桃园六舍"] },
  { name: "北碚校门", options: ["一号门", "二号门", "三号门", "五号门"] },
  { name: "图书馆位置", options: ["中心图书馆", "弘文图书馆", "崇实图书馆"] },
  { name: "运动场位置", options: ["一运", "二运", "三运", "四运"] },
  { name: "景点", options: ["崇德湖", "共青团花园"] },
  { name: "教室位置", options: ["1教文学院", "2教化学化工学院药学院", "3教国治院马克思主义学院", "4教新传院", "5教外院", "9教历院", "11教教育学部教师教育学院", "13教物院", "14教生科院", "15教美院", "19教音乐学院", "21教材料与能源学院", "23教心理学部", "24教地科院", "25教计信院", "26教含弘学院", "33教蚕桑院园艺园林学院", "34教植保院", "35教资环院", "36教工院", "37教农生院", "38教法学院", "40教食科院", "46教经管院"] },
];

const ALL_LOCATIONS = LOCATION_GROUPS.reduce((acc, group) => acc.concat(group.options), []);

module.exports = {
  LOCATION_GROUPS,
  ALL_LOCATIONS,
};
